//
//  LGEnglishTrainingVersion.h
//  LGEnglishTrainingFramework
//
//  Created by lg on 2019/4/29.
//  Copyright © 2019 lg. All rights reserved.
//

#ifndef LGEnglishTrainingVersion_h
#define LGEnglishTrainingVersion_h

/** 版本：1.0.3   2019-12-25 */
/**
 1、英语训练更新cocoapod
 */

/** 版本：1.0.2.6   2019-12-19 */
/**
 1、优化阅读训练知识点列表
 2、优化阅读训练预览内容换行
 3、优化听力训练听写界面提示语
 4、优化资料列表标题跑马灯效果
 5、优化听力选择标题显示问题
 6、优化作答提交按钮
 */

/** 版本：1.0.2.5   2019-12-12 */
/**
 1、英语训练提示语优化
 */

/** 版本：1.0.2.4   2019-12-06 */
/**
 1、英语训练UI优化
 */

/** 版本：1.0.2.3   2019-12-03 */
/**
 1、英语训练恢复训练VIP权限判断
 */

/** 版本：1.0.2.2   2019-11-28 */
/**
 1、英语训练提交提示语优化
 */

/** 版本：1.0.2.1   2019-11-23 */
/**
 1、英语训练iPad适配优化
 */

/** 版本：1.0.2   2019-11-23 */
/**
 1、英语训练iPad适配优化
 */

/** 版本：1.0.0.17    2019-11-11 */
/**
 1、英语训练iPad适配优化
 */

/** 版本：1.0.0.16    2019-10-31 */
/**
 1、英语训练音视频VIP权限控制调整
 */

/** 版本：1.0.0.15    2019-10-30 */
/**
 1、英语训练音视频增加VIP权限控制
 */

/** 版本：1.0.0.14    2019-10-28 */
/**
 1、英语训练无数据图更新
 */

/** 版本：1.0.0.13    2019-10-16 */
/**
 1、英语训练添加资料预览跳转接口
 */

/** 版本：1.0.0.12    2019-10-11 */
/**
 1、完成英语训练iPad适配
 2、修改英语训练资料列表界面当有过训练记录时才不显示“未完成训练”
 */

/** 版本：1.0.0.11    2019-9-29 */
/**
 1、修改英语训练资料列表界面不显示“未完成训练”
 */

/** 版本：1.0.0.10    2019-9-29 */
/**
 1、英语训练首页简单适配iPad
 */

/** 版本：1.0.0.9    2019-9-27 */
/**
 1、新增网络请求打印回调
 */

/** 版本：1.0.0.8    2019-9-21 */
/**
 1、新增模块将要退出回调
 */

/** 版本：1.0.0.7    2019-9-19 */
/**
 1、优化课外计划对接英语训练时训练后重新训练没有恢复上次训练的语速。
 */

/** 版本：1.0.0.6    2019-9-12 */
/**
 1、优化英语训练听力预览音频卡顿后播放无声音问题
 */

/** 版本：1.0.0.5    2019-9-6 */
/**
1、修改英语训练高亮生词匹配标签错误问题
 */

/** 版本：1.0.0.4    2019-9-5 */
/**
 1、处理英语听力训练听力选择中音频播放问题
 */

/** 版本：1.0.0.3    2019-9-4 */
/**
 1、英语训练作答倒计时调整显示不到0s
 */

/** 版本：1.0.0.2    2019-9-3 */
/**
 1、英语训练重新训练时清除所有作答记录
 */

/** 版本：1.0.0.1    2019-9-2 */

#endif /* LGEnglishTrainingVersion_h */
