//
//  LGEnglishTrainingVersion.h
//  LGEnglishTrainingFramework
//
//  Created by lg on 2019/4/29.
//  Copyright © 2019 lg. All rights reserved.
//

#ifndef LGEnglishTrainingVersion_h
#define LGEnglishTrainingVersion_h

/** 版本：1.0.0.10    2019-9-29 */
/**
 1、英语训练首页简单适配iPad
 */

/** 版本：1.0.0.9    2019-9-27 */
/**
 1、新增网络请求打印回调
 */

/** 版本：1.0.0.8    2019-9-21 */
/**
 1、新增模块将要退出回调
 */

/** 版本：1.0.0.7    2019-9-19 */
/**
 1、优化课外计划对接英语训练时训练后重新训练没有恢复上次训练的语速。
 */

/** 版本：1.0.0.6    2019-9-12 */
/**
 1、优化英语训练听力预览音频卡顿后播放无声音问题
 */

/** 版本：1.0.0.5    2019-9-6 */
/**
1、修改英语训练高亮生词匹配标签错误问题
 */

/** 版本：1.0.0.4    2019-9-5 */
/**
 1、处理英语听力训练听力选择中音频播放问题
 */

/** 版本：1.0.0.3    2019-9-4 */
/**
 1、英语训练作答倒计时调整显示不到0s
 */

/** 版本：1.0.0.2    2019-9-3 */
/**
 1、英语训练重新训练时清除所有作答记录
 */

/** 版本：1.0.0.1    2019-9-2 */

#endif /* LGEnglishTrainingVersion_h */
